//1. В чем заключается суть ключевого слова global? Когда его применение целесообразно?


//2. Какие суперглобальные переменные вы знаете?


//3. Когда нужно использовать закрывающий дескриптор “?>“?


//4. Что выведет программа в каждом случае и почему?

<?php

function changeX($x){
    $x += 5;
    echo $x;
}

$x = 1;
echo $x;
changeX($x);
echo $x;

?>

// 5. Что выведет программа в каждом случае и почему?

<?php

function test() {
    static $a = 0;
    echo $a;
    $a++;
}

test();
test();
test();

?>


// 6. Как перевернуть массив? Есть массив array(‘h’, ‘e’, ‘l’, ‘l’, ‘o’), как из него получить array(‘o’, ‘l’, ‘l’, ‘e’, ‘h’)?


//7. Как перевернуть строку задом наперед?


//8. Что будет результатом работы данного кода?

<?php

$a=0;
if($b=$a)
    echo "One";
else
    echo "Two";

?>

//9. Сгенерировать три случайных числа в диапазоне от 0 до 10. Если сумма этих чисел меньше 15, сгенерировать новую тройку.


//10. Какое число выведет данный код?

<?php

$i = 10;
$i += ++$i + $i + $i++;
echo $i;

?>

//11. Что выведет приведенный ниже код?

<?php

$a = "1";
$a[$a] = "2";
echo $a;

?>

